{
  "basics": {
    "name": "Ignacio Arce",
    "label": "Senior Full Stack Engineer",
    "image": "https://bettervet.com/hs-fs/hubfs/BetterVet_October2022/images/Ignacio%20Arce.jpeg",
    "email": "iarce@dc.uba.ar",
    "phone": "(+54) 11 52578577",
    "profiles": [
      {
        "network": "Github",
        "username": "ignacio-arce",
        "url": "https://github.com/ignacio-arce"
      },
      {
        "network": "netlify",
        "username": "ignacio-arce",
        "url": "https://ignacio-arce.github.io/"
      },
      {
        "network": "Linkedin-square",
        "username": "ignacio-arce",
        "url": "https://www.linkedin.com/in/ignacio-arce/"
      }
    ]
  },
  "work": [
    {
      "location": "New York, NY",
      "name": "The Vets",
      "description": "Veterinary Services",
      "position": "Senior Full Stack Engineer",
      "url": "https://thevets.com",
      "startDate": "2024-11-01",
      "endDate": "Present",
      "time": "9 mos",
      "summary": "Leading the end‑to‑end development and operations of The Vets iPad app and backend microservices, ensuring high availability, scalability, and customer migrations",
      "highlights": [
        "Orchestrated bi‑weekly production releases of the iPad application used by veterinarians, reducing rollout time by 30% and eliminating rollback incidents through automated CI/CD pipelines.",
        "Performed proactive upkeep, scaling and troubleshooting across 32 Node.js microservices on AWS EKS, cutting incident response times and improving overall system uptime to 99.9%.",
        "Spearheaded the data and configuration migration of 1,200+ BetterVet clients into The Vets platform, executing zero‑downtime cutovers and achieving full data integrity validation.",
        "Designed, implemented, and maintained new functionality in over ten repositories (frontend React Native/React, backend Node.js/TypeScript)."
      ]
    },
    {
      "location": "Boston, MA",
      "name": "BetterVet",
      "description": "Stress-Free, In-Home Veterinary Care",
      "position": "Senior Backend Engineer",
      "url": "https://www.bettervet.com",
      "startDate": "2021-12-01",
      "endDate": "2024-11-01",
      "time": "2 yrs 11 mos",
      "summary": "As one of the first six engineers, I contributed significantly to scaling the company from 5,000 to 500,000 users and growing the team to 200+ employees. My work spanned full-stack development, system optimization, and feature delivery.",
      "highlights": [
        "Designed and implemented a user-friendly mobile app for clients and veterinarians, improving engagement and appointment bookings.",
        "Migrated monolithic deployments on AWS EC2 to containerized ECS clusters, achieving availability and zero‑downtime updates.",
        "Engineered a custom scheduling engine reducing no‑show rates by 35% and streamlining clinic operations.",
        "Developed a referral incentive program that lifted user retention by 20% and generated 15% of new sign‑ups.",
        "Integrated SquareUp and Gravity payments APIs with a unified abstraction layer, simplifying third‑party service swaps.",
        "Led bi‑weekly code reviews and mentored junior engineers, raising overall code quality"
      ]
    },
    {
      "location": "Buenos Aires, Argentina",
      "name": "Technisys",
      "description": "Finantial Services",
      "position": "Senior Front End Developer",
      "url": "https://www.technisys.com",
      "startDate": "2021-04-01",
      "endDate": "2021-12-01",
      "time": "9 mos",
      "summary": "Contributed to a 14‑member team modernizing Diners Club’s digital banking interfaces, focusing on frontend architecture, performance and UI consistency.",
      "highlights": [
        "Developed and maintained user interfaces for web and mobile applications using React and React Native, collaborating closely with a 14-member team to deliver a seamless user experience.",
        "Implemented advanced state management solutions utilizing Redux Thunk and Redux Sagas to improve application efficiency and maintainability.",
        "Styled components using Sass and Stylesheets, following design specifications, and set up Storybook for consistent UI documentation and testing.",
        "Collaborated with QA team to deliver high-quality code faster using Jest for unit testing."
      ]
    },
    {
      "location": "Buenos Aires, Argentina",
      "name": "Orbit",
      "description": "Freelance",
      "position": "Full Stack Developer",
      "url": "https://wwww.orbit.com.ar",
      "startDate": "2021-02-01",
      "endDate": "2021-08-01",
      "time": "7 mos",
      "summary": "Delivered end‑to‑end mobile and backend solutions across diverse projects, adapting quickly to client requirements and tight timelines.",
      "highlights": [
        "Developed and maintained mobile applications using React Native across multiple projects, ensuring functionality and a user-friendly interface.",
        "Built backend services with Nest.js and TypeORM for data management and server-side logic in select projects.",
        "Implemented features and integrations such as Google Maps API, form validation with Formik and Yup, and state management with Redux Thunk.",
        "Adapted quickly to diverse project needs, delivering quality results for each application in a short time frame."
      ]
    },
    {
      "location": "Buenos Aires, Argentina",
      "name": "Onready",
      "description": "Software Factory",
      "position": "Software Developer",
      "url": "https://github.com/onready",
      "startDate": "2020-03-01",
      "endDate": "2021-04-01",
      "time": "1 yr 2 mos",
      "summary": "Worked in an Agile/Scrum software factory delivering PHP, Node.js and React solutions for e‑commerce and fintech clients.",
      "highlights": [
        "Developed a Magento multivendor plugin (PHP) and designed its UI with jQuery, HTML5 and CSS3.",
        "Built RESTful APIs in Node.js for ePak (OCA) integration and PayGoal wallet management, deployed on AWS ECS.",
        "Created React‑based admin panels and mobile apps in React Native for managing wallet transactions and client operations.",
        "Improved deployment processes by introducing automated tests and Docker containers."
      ]
    }
  ],
  "skills": [
    {
      "name": "Backend",
      "level": "Master",
      "keywords": [
        "Node",
        "Java",
        "SQL & NoSQL (MongoDB)",
        "Docker",
        "AWS (SQS, ECS, EKS, Lambda)",
        "Kubernetes",
        "CI/CD (GitHub Actions, Jenkins)"
      ]
    },
    {
      "name": "Frontend",
      "level": "Master",
      "keywords": [
        "React",
        "React Native",
        "HTML5 & CSS3",
        "Sass",
        "TypeScript",
        "Jest",
        "Storybook"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Conversational"
    },
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    }
  ],
  "references": [
    {
      "name": "Matthew Harris, CTO (BetterVet)",
      "reference": "“I had the pleasure of working with Ignacio, who grew from a developer into a highly skilled senior engineer. His dedication, strong coding practices, and willingness to mentor others made a significant impact on the team. I highly recommend him for any opportunity.”"
    },
    {
      "name": "Nahuel Schlegel, Backend & Infrastructure Engineering Manager (BetterVet)",
      "reference": "“Ignacio is a great developer! He manages projects independently from the beginning to launch. He resolves everything; if he doesn't know something, he researches, asks, and solves it. He has been one pillar for BetterVet, working on multiple projects side by side with the team. He is very proactive, self-taught, and a very good teammate.”"
    }
  ],
  "projects": [
    {
      "name": "Lexikon",
      "description": "Greek Language Learning App: Developed the backend using Nest.js and TypeORM, and built a mobile app with React Native for interactive language learning.",
      "startDate": "2021-02-01",
      "endDate": "2021-03-01",
      "highlights": [],
      "url": "javascript:void(0)",
      "entity": "Smoogle",
      "type": "API and Mobile App"
    },
    {
      "name": "Tiendas Tic",
      "description": "Product Delivery App: Implemented features including Google Maps integration, and used React Native Paper for UI components, while handling form management with Formik and Yup.",
      "highlights": [],
      "startDate": "2021-03-01",
      "endDate": "2021-06-01",
      "url": "https://tiendas-tic.vercel.app/",
      "entity": "Smoogle",
      "type": "Mobile App"
    },
    {
      "name": "Helpy",
      "description": "Emergency Alert App: Created an application to help elderly or disabled users alert their relatives in emergencies, using React Native, Formik, Yup, and Redux Thunk for robust form handling and state management.",
      "highlights": [],
      "startDate": "2021-06-01",
      "endDate": "2021-08-01",
      "url": "https://www.linkedin.com/feed/update/urn:li:activity:6848191746078257152/",
      "entity": "Smoogle",
      "type": "Mobile App"
    },
    {
      "name": "Veterinarian Admin Panel",
      "description": "Led the migration of legacy software to a modern architecture using the tRPC framework. The project involved transitioning outdated systems to a new, more scalable solution, while ensuring data integrity.",
      "highlights": [],
      "startDate": "2024-06-01",
      "endDate": "2024-09-01",
      "url": "javascript:void(0)",
      "entity": "Smoogle",
      "type": "API and Web App"
    }
  ]
}